tutorials/waveFoamGABC/combinedGABC_IHFOAM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (-6.285 -0.1 -0.5 )
    (  0 -0.1 -0.5 )
    (-6.285  0.1 -0.5 )
    (  0 0.1  -0.5 )

    (-6.285 -0.1  0.3025 )
    (  0 -0.1  0.3025 )
    (-6.285  0.1  0.3025 )
    (  0  0.1  0.3025 )
);

blocks          
(
    hex (0 1 3 2 4 5 7 6) ( 838 1 107 ) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch inlet
    (
        (0 4 6 2)
    )
    patch bottom 
    (
        (0 1 3 2)
    )
    patch outlet
    (
        (1 5 7 3)
    )

    patch atmosphere 
    (
        (4 5 7 6)
    )
    
    empty back
    (
        (0 1 5 4)
    )

    empty front
    (
        (2 3 7 6)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
